/*
Кривошейцев Михаил Б763-2
Вариант B
1.  Вывести на экран таблицу умножения.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Таблица умножения:");
        for (int i = 1; i <= 10; i++) {
            for (int j = 1; j <= 10; j++) {
                System.out.print(i + " * " + j + " = " + (i * j) + "\t");
            }
            System.out.println();
        }
    }
}